{
    "b021df6a": "[\"What are labels used for in Kubernetes?\", \"How are labels structured in Kubernetes?\", \"What is the role of key/value pairs in labeling objects?\", \"Why might users find labels meaningful and relevant?\", \"Which Kubernetes objects can have labels attached to them?\"]",
    "76d16796": "[\n    \"What is the purpose of a check that runs periodically on a container in a pod?\",\n    \"How does the check influence the lifecycle of a container?\",\n    \"Where can you find more detailed information about container probes?\"\n]",
    "0ad333e2": "[\"What is the primary purpose of a LimitRange in Kubernetes?\", \"How does a LimitRange help manage resources within a namespace?\", \"In what ways can a LimitRange restrict resources for containers or Pods?\", \"Can a LimitRange affect the number of certain resource types created?\"]",
    "6a399164": "[\"What is the purpose of the device classes defined by device drivers and cluster admins in Kubernetes?\", \"How does Kubernetes handle allocation of devices to specific claims?\", \"What role do hardware accelerators play in Kubernetes resource sharing among Pods?\"]",
    "dc1d4e05": "[\"What are some ways a platform developer can add new functionalities to their Kubernetes instance?\", \"How might platform developers contribute to the broader Kubernetes community?\", \"Can platform developers create extensions that are not shared publicly?\"]",
    "8e58cd87": "[\"What role does a reviewer play in maintaining the quality of the codebase?\", \"What qualifications or knowledge does a reviewer need to have?\", \"Is a reviewer's responsibility limited to the entire codebase or specific parts?\", \"Why might the scope of a reviewer be limited to just a part of the codebase?\", \"How do reviewers contribute to the software development process?\"]",
    "99bc4b85": "[\"What is the purpose of CustomResourceDefinitions in Kubernetes?\", \"How do CustomResourceDefinitions help if the built-in Kubernetes functionality is insufficient?\", \"Do CustomResourceDefinitions require building a new custom server to extend the Kubernetes API?\"]",
    "e21cb987": "[\"What does the term 'upstream' mean in the context of the Kubernetes Community?\", \"How is the term 'upstream' used differently in GitHub or git compared to the Kubernetes Community?\", \"Why might a community member want to move a feature upstream in Kubernetes?\", \"In git terminology, what is the relationship between an upstream and a downstream repository?\", \"What does the Kubernetes Community mean by referring to other code or tools relying on the core Kubernetes codebase?\"]",
    "0bcfa281": "[\"What was the purpose of the extension API mentioned in the Kubernetes documentation?\", \"How did the extension API assist with using external managed software offerings?\", \"What kind of services could Kubernetes clusters connect with using the extension API?\"]",
    "0becb50d": "[\"What role do admission controllers play when a request is made to the Kubernetes API server?\", \"How do mutating admission controllers differ from validating admission controllers?\", \"Is it possible for an admission controller to both modify and reject a request in Kubernetes?\", \"What type of admission controller has the ability to modify objects before they are stored?\", \"Can a validating admission controller change the objects they process in Kubernetes?\"]",
    "3786473d": "[\"What are some examples of day-to-day operations involved in managing a Kubernetes cluster?\", \"How can a cluster be scaled by adding resources?\", \"What types of activities are involved in configuring cluster networking?\", \"Why is implementing security controls important in Kubernetes cluster management?\", \"What does managing cluster-wide observability entail in the context of Kubernetes?\"]",
    "34171d17": "[\n    \"What is the purpose of defining claims storage in Kubernetes?\",\n    \"What are the different ways storage can be accessed in Kubernetes?\",\n    \"How is storage reclaimed in Kubernetes once it is no longer needed?\",\n    \"In what Kubernetes object are the specifics of the storage described?\",\n    \"How is the storage claim used in relation to a volume in Kubernetes?\" \n]",
    "23d21ad4": "[\"What are some specific ways a person can contribute to the Kubernetes project or community?\", \"Does contributing to the Kubernetes project only involve donating code?\", \"Besides code contributions, what are other forms of participation in the Kubernetes community?\", \"Can organizing events be considered a form of contribution to the Kubernetes project?\", \"How can someone provide feedback as a contribution to the Kubernetes project?\"]",
    "b8724da7": "[\"What is an endpoint in the context of a Kubernetes Service?\", \"How does the EndpointSlice controller function when a Service has a selector?\", \"How can EndpointSlices be used for Services that do not have a selector?\"]",
    "8e9db3d1": "[\"What defines immutable infrastructure, and why can't it be changed after deployment?\", \"How does immutability help in identifying and mitigating security risks?\", \"What role does automation play in enforcing immutability within an infrastructure?\", \"How are containers an example of immutable infrastructure?\", \"What is the relationship between immutable infrastructure and infrastructure as code?\"]",
    "a941f8ad": "[\"What are the possible ways to consume a ConfigMap in Kubernetes?\", \"How does a ConfigMap help in making applications portable?\", \"What kind of data is stored in a ConfigMap?\"]",
    "5e2f5f3c": "[\"What is the purpose of extensions in Kubernetes?\", \"Why might many Kubernetes users not need to install extensions themselves?\", \"Do most Kubernetes users need to create their own extensions?\"]",
    "a226e9fb": "[\"What is the role of etcd in a Kubernetes cluster?\", \"Why is it important to have a backup plan in place for etcd?\", \"Where can I find more detailed information about etcd?\"]",
    "f47b1769": "[\"What is the purpose of using HostAliases in Kubernetes?\", \"When are HostAliases applied to a Pod's hosts file?\", \"Can HostAliases be used with hostNetwork Pods?\", \"Where can you find more information about the HostAliases feature in Kubernetes?\", \"Is it mandatory to specify HostAliases for a Pod?\"]",
    "b2ceaf1b": "[\"What is the main purpose of CNI plugins in Kubernetes?\", \"What specification do CNI plugins follow?\", \"Where can more information about Kubernetes and CNI be found in the documentation?\"]",
    "ae45514e": "[\"What is the primary purpose of a sidecar container in Kubernetes?\", \"How do sidecar containers differ from regular app containers in terms of their lifecycle?\", \"Where can I find more detailed information about sidecar containers in Kubernetes?\"]",
    "3d398179": "[\"What role do DeviceClasses play in dynamic resource allocation within a Kubernetes cluster?\", \"Who is responsible for defining DeviceClasses in a Kubernetes environment?\", \"How are devices claimed in a workload using DeviceClasses?\", \"Where can one find more information about Dynamic Resource Allocation related to DeviceClasses?\"]",
    "263d5008": "[\"What is the role of the API server in Kubernetes?\", \"How does the Kubernetes API server scale to handle increased demand?\", \"What is kube-apiserver and where can its main implementation be found?\", \"How can traffic be managed when multiple instances of kube-apiserver are deployed?\", \"What component acts as the front end for the Kubernetes control plane?\"]",
    "bd7a9717": "[\n    \"What happens to a Kubernetes volume when a container within the pod restarts?\",\n    \"How long does a Kubernetes volume exist in relation to the pod that contains it?\",\n    \"Where can one find more details about Kubernetes storage concepts?\"\n]",
    "d5f30667": "[\n  \"What is the purpose of ResourceClaims in Kubernetes?\",\n  \"How do ResourceClaims facilitate dynamic resource allocation (DRA) for Pods?\",\n  \"Who can create ResourceClaims in a Kubernetes environment?\"\n]",
    "fecb13f1": "[\"What is node-pressure eviction and how does it help manage resources on a Kubernetes node?\", \"Which resources does the kubelet monitor to trigger node-pressure eviction?\", \"How does node-pressure eviction differ from API-initiated eviction in Kubernetes?\", \"What actions does the kubelet take when resource consumption reaches critical levels on a node?\", \"Why is node-pressure eviction important for preventing resource starvation in a Kubernetes cluster?\"]",
    "b7144de2": "[\"What role does preemption play in scheduling pending Pods?\", \"How does Kubernetes decide which Pods to evict when using preemption?\", \"What happens if a Pod cannot initially be scheduled on any Node?\"]",
    "0e7278cd": "[\"What is a container in the context of Kubernetes?\", \"How do containers simplify application deployment across various environments?\", \"What is the term used for applications running inside containers?\", \"What does the process of containerization involve?\", \"Why are containers considered lightweight and portable?\"]",
    "249694a4": "[\"What is the minimum number of worker nodes required in a Kubernetes cluster?\", \"What role do worker nodes play in managing application workloads?\", \"How does the control plane contribute to fault-tolerance and high availability in a Kubernetes cluster?\"]",
    "ee043734": "[\"What is the purpose of the aggregation layer in a Kubernetes cluster?\", \"How can you extend your Kubernetes cluster to include additional APIs?\", \"What is an `APIService` object used for in relation to the aggregation layer?\"]",
    "f03bde11": "[\n    \"What does the legacy term 'hosting the' refer to in Kubernetes documentation?\",\n    \"How is the legacy term still being used by provisioning tools and managed services?\",\n    \"What role does the 'kubernetes.io/role' label play in the usage of the legacy term?\"\n]",
    "5f8b6080": "[\"What roles does a person involved in developing Kubernetes typically undertake?\", \"Is contributing code the only way a developer can participate in the Kubernetes community?\", \"What does it mean to be an active participant in the Kubernetes ecosystem?\"]",
    "63c0a62f": "[\"What is the purpose of compiling separate processes into a single binary in Kubernetes?\", \"Why is it beneficial to run multiple processes as a single process in the control plane component?\", \"How does running processes as a single binary affect the complexity of Kubernetes components?\"]",
    "b06f5d40": "[\"What is the purpose of CRI-O within the Kubernetes ecosystem?\", \"How does CRI-O enable Kubernetes to interact with container runtimes?\", \"Can CRI-O work with container images from remote sources, and if so, how?\", \"What specification must the container runtimes adhere to for compatibility with CRI-O?\", \"Why might someone choose CRI-O when deploying Kubernetes?\"]",
    "1e6947ac": "[\"What are some examples of sensitive information that can be managed by Kubernetes Secrets?\", \"How are Secret values encoded and stored by default in Kubernetes?\", \"What are the methods a Pod can utilize to access a Secret in Kubernetes?\", \"What is the main difference between Secrets and ConfigMaps in terms of data confidentiality?\", \"What configuration change can be applied to enhance the security of stored Secrets in Kubernetes?\"]",
    "b3a7464b": "[\"What is the purpose of the Kubernetes downward API in relation to containers?\", \"Why might a container need information about itself without directly accessing the Kubernetes API?\", \"What are the two methods used by Kubernetes to provide Pod and container field values to containers?\", \"How does the downward API help applications running in containers with accessing their context within a Kubernetes cluster?\", \"Why is it beneficial for applications in containers to access field values without acting as a Kubernetes API client?\"]",
    "4c9a5c67": "[\"What role does the CNCF play in relation to container orchestration projects?\", \"How is Kubernetes related to the CNCF?\", \"What is the main goal of the CNCF?\", \"Under which larger organization does the CNCF operate?\", \"What is the connection between CNCF projects and microservices architecture?\"]",
    "7f69215e": "[\"What is the role of an architect in the design of an application?\", \"How does an architect ensure the scalability and maintainability of an application?\", \"What are some examples of surrounding components an application must interact with?\", \"Why is it important for an app's implementation to interact effectively with its surrounding components?\", \"What aspects of application design does an architect focus on?\"]",
    "1c93756c": "[\"What are the main cloud providers currently supported by kOps, and what are their support statuses?\", \"How does kOps handle system failures within a Kubernetes cluster?\", \"What role does DNS play in the functioning of kOps when managing Kubernetes clusters?\", \"What are the operating systems that kOps supports for its Kubernetes installations?\", \"In what ways can kOps set up the cloud infrastructure necessary for a Kubernetes cluster?\"]",
    "c4e93a4e": "[\"What are container environment variables in Kubernetes and what do they provide to running containers?\", \"What kind of information can container environment variables include for containerized applications?\", \"How do container environment variables relate to other cluster resources such as service endpoints in Kubernetes?\"]",
    "9d828e3a": "[\"What does the term 'downstream' refer to in the context of the Kubernetes Community?\", \"How is the term 'downstream' used differently in GitHub or git compared to the Kubernetes Community?\", \"What does it mean for an application to adopt a new feature 'downstream' in Kubernetes?\", \"What is the relationship between upstream and downstream repositories in git conventions?\"]",
    "bc2fdfa2": "[\"What is the purpose of NetworkPolicies in Kubernetes?\", \"How do NetworkPolicies define which Pods can communicate with each other?\", \"What components are necessary for a NetworkPolicy to be effective in controlling network traffic?\", \"What role do network plugins play in the implementation of NetworkPolicies?\", \"Can NetworkPolicies be used to specify communication rules across different namespaces?\"]",
    "6a3918c8": "[\"What is the purpose of Pod Priority in Kubernetes?\", \"How does Pod Priority impact the scheduling of Pods in a cluster?\", \"Why is Pod Priority considered important for workloads in production clusters?\"]",
    "56e11537": "[\"What is the purpose of allowing a kube-apiserver to proxy resource requests to a different peer API server?\", \"How does this feature benefit clusters with multiple API servers running different Kubernetes versions?\", \"What must be done to activate the feature that allows the kube-apiserver to proxy requests?\", \"Which feature gate needs to be enabled to use the kube-apiserver proxy feature?\", \"Is the kube-apiserver proxy feature enabled by default in Kubernetes?\"]",
    "be53a054": "[\"What does a stored instance of software contain that's necessary for running an application?\", \"How is software packaged for storage and execution in a container within Kubernetes?\", \"What type of information is included in the metadata of a container image?\", \"Where can software packaged as a container be stored before it is pulled to a local system?\", \"What kind of information does the metadata in a container image provide about the executable and its creator?\"]",
    "f98c6e23": "[\"What is a disruption in Kubernetes and what is its impact on workload management?\", \"How does Kubernetes define a voluntary disruption?\", \"What is considered an involuntary disruption in Kubernetes?\", \"What are some potential causes of involuntary disruptions in a Kubernetes cluster?\", \"Where can I find more information about disruptions in Kubernetes?\"]",
    "a68d46fa": "[\"What are device plugins used for in Kubernetes?\", \"How do device plugins inform about available resources?\", \"What are the methods to deploy a device plugin in Kubernetes?\", \"Why might a device plugin require vendor-specific initialization?\", \"Where can you find more detailed information on device plugins?\"]",
    "f206f583": "[\"What is the main problem with using a simple hash-based scheme for assigning requests to queues?\", \"How does shuffle-sharding improve insulation between low-intensity and high-intensity request flows?\", \"What metaphor is used to explain the shuffle-sharding technique, and how does it apply to queue selection?\", \"Why is the choice of hand size important in the shuffle-sharding technique?\", \"What characteristics of a request are typically used in a hash function to determine the queue index in a simple hash-based scheme?\"]",
    "e6f4d685": "[\"What are the three required properties of a core object in Kubernetes?\", \"How do tolerations affect pod scheduling on nodes?\", \"Can a pod with a specific toleration be scheduled on a node without a matching property?\", \"What role do tolerations play in preventing pods from being scheduled on unsuitable nodes?\", \"Is it necessary for a pod to be scheduled on a node if its toleration matches the node's properties?\"]",
    "e7d22294": "[\"What is the purpose of a UID in Kubernetes?\", \"How does Kubernetes ensure each object has a unique identity?\", \"Why is it important for every object in a Kubernetes cluster to have a distinct UID?\", \"Can UIDs help in distinguishing between similar entities over time in Kubernetes?\", \"What role does a UID play in managing the lifecycle of objects in a Kubernetes cluster?\"]",
    "3ea414e1": "[\"What are the two types of pod disruptions mentioned in Kubernetes?\", \"Who typically initiates voluntary pod disruptions?\", \"What are some causes of involuntary pod disruptions in Kubernetes?\"]",
    "5b2c1651": "[\"What is the primary function of a HorizontalPodAutoscaler (HPA) in Kubernetes?\", \"To what types of Kubernetes objects can HorizontalPodAutoscaler be applied?\", \"Why might a HorizontalPodAutoscaler not be suitable for certain Kubernetes objects?\"]",
    "d8613296": "[\"What is the difference between Infrastructure as a Service (IaaS) and Platform as a Service (PaaS) in the context of cloud providers?\", \"What responsibilities does a cloud provider take on when offering a managed infrastructure service?\", \"In a managed Kubernetes service, what components is the cloud provider responsible for overseeing?\", \"How does the role of a cloud provider change when offering Kubernetes as a managed service compared to a managed infrastructure service?\", \"What elements besides networking and storage might a cloud provider manage in a Platform as a Service offering?\"]",
    "da0a2841": "[\"What type of interface does the Kubernetes application use to serve functionality and store the state of the cluster?\", \"In what format are Kubernetes resources and records of intent stored, and how can they be modified?\", \"What does configuring Kubernetes through the API in a declarative way allow users to do?\", \"Besides direct interaction, what tool can users use to interact with the Kubernetes API?\", \"How can the core Kubernetes API be extended?\"]",
    "9aaf2d0a": "[\"What are the main responsibilities of a cluster operator in Kubernetes?\", \"How does a cluster operator's role differ from the Operator pattern in Kubernetes?\", \"What tasks might a cluster operator perform to ensure a cluster remains operational?\"]",
    "7fd622e2": "[\n    \"What is the role of the container orchestration layer in Kubernetes?\",\n    \"What forms can the components of the orchestration layer take when running on a host?\",\n    \"How were the hosts running the orchestration layer components historically referred to?\"\n]",
    "ea11065c": "[\"What is the primary role of kube-proxy in a Kubernetes cluster?\", \"How does kube-proxy facilitate communication to Pods within the cluster?\", \"What mechanism does kube-proxy use if the operating system packet filtering layer is unavailable?\", \"Does kube-proxy work with both internal and external network sessions?\", \"Where can I find more detailed information about kube-proxy's command-line tools?\"]",
    "87b6269f": "[\n  \"What is a JWT and why is it used in Kubernetes?\",\n  \"How does Kubernetes utilize JWTs for authentication?\",\n  \"Can JWTs be encrypted as well as digitally signed in Kubernetes?\"\n]",
    "6f49e891": "[\"What actions can the kubectl command line tool perform on Kubernetes objects?\", \"How is the term 'kubectl' officially pronounced?\", \"What does the kubectl tool use to interact with a Kubernetes cluster?\"]",
    "7641016e": "[\"What are the different phases that a Pod can go through during its lifecycle?\", \"How is the current state of a Pod described in Kubernetes?\", \"Where can one find a high-level summary of a Pod's state?\", \"Why might a Pod's state be described as 'Unknown'?\", \"What is the significance of the PodStatus 'phase' field in Kubernetes?\"]",
    "63912595": "[\"What is the purpose of a CronJob in Kubernetes?\", \"How does a CronJob determine when to execute a task?\", \"What format does a CronJob use to specify its schedule?\", \"In what way is a CronJob similar to a crontab file?\", \"Where can I find additional information about how a Job functions within Kubernetes?\"]",
    "694e8d1f": "[\"How are fractional numbers represented using SI suffixes in Kubernetes?\", \"What is the representation of the number 1000 using SI suffixes?\", \"Which units are considered power-of-10 and how are they represented?\", \"What is the equivalent of the binary number 2048 using binary-notation suffixes?\", \"How does the `k` in kilo differ in case compared to other SI units in Kubernetes?\"]",
    "a83c0397": "[\"What is the primary focus of an application developer in a Kubernetes cluster?\", \"How might the scale of an application developer's focus in a Kubernetes cluster differ?\", \"Who is responsible for writing applications that run within a Kubernetes cluster?\"]",
    "63e6413d": "[\"What is dockershim and which versions of Kubernetes include it?\", \"When was dockershim removed from Kubernetes?\", \"Where can I find more information about the removal of dockershim?\"]",
    "a2c88367": "[\"What is the purpose of the sysctl interface in Unix-like systems?\", \"In what two forms does sysctl exist on Unix-like systems?\", \"Why might some runtimes and network plugins depend on specific sysctl values?\"]",
    "6c3a6944": "[\"What types of machines can a Kubernetes worker node be?\", \"Who manages the worker nodes in a Kubernetes cluster?\", \"What were nodes called in the early versions of Kubernetes?\"]",
    "f2065865": "[\"What is the purpose of using a verb in Kubernetes to track changes to an object?\", \"How does 'watch' contribute to detecting changes in Kubernetes?\", \"What is an example of a situation where a watch would be more efficient than polling in Kubernetes?\", \"Where can one find more information about efficient change detection in the Kubernetes API?\"]",
    "00d3fcb5": "[\"What is the purpose of workload management in Kubernetes?\", \"How does the control plane maintain the correct number of Pods running?\", \"Why is ReplicationController no longer recommended in Kubernetes?\"]",
    "69653f1f": "[\"What is a PriorityClass in Kubernetes and why is it important for scheduling Pods?\", \"How does a PriorityClass map a name to an integer priority, and what fields are used to specify these?\", \"What is the range of integer values for priority, and what does a higher value indicate in terms of priority?\", \"Is a PriorityClass a namespaced object or not, and what does that imply?\", \"Where can the name of a PriorityClass be specified within its configuration?\"]",
    "045efe41": "[\"What is the primary purpose of FlexVolumes in Kubernetes?\", \"Why does implementing FlexVolume drivers require root access?\", \"What does the Storage SIG recommend as an alternative to FlexVolumes?\", \"What are some potential limitations associated with FlexVolumes?\", \"Where can users find more detailed information about FlexVolume usage and development?\"]",
    "0d4eb61d": "[\"What purpose does ensuring a copy of something running across multiple nodes serve?\", \"Why are system daemons like log collectors and monitoring agents deployed in this manner?\", \"What is typically required to run on every node according to the text?\"]",
    "16492b66": "[\"What are some contexts in which the term can have different meanings?\", \"Why is the term described as overloaded in the documentation?\", \"How should one approach understanding a term with multiple meanings in Kubernetes?\"]",
    "1472974b": "[\"What are feature gates in Kubernetes and what is their purpose?\", \"How can you enable or disable feature gates in a Kubernetes cluster?\", \"Are feature gates specific to each Kubernetes component or are they universal across all components?\", \"Where can you find a list of current feature gates and their functions in Kubernetes?\", \"What does the '--feature-gates' command line flag do in the context of Kubernetes components?\"]",
    "6833d8d1": "[\"What is the purpose of the operator pattern in Kubernetes?\", \"How can Kubernetes be extended beyond its built-in controllers?\", \"What role does a running application play in the operator pattern?\", \"What is required for an application to be considered an example of the Operator pattern?\", \"How does a controller perform tasks against a custom resource in Kubernetes?\"]",
    "0e37f131": "[\"What is the purpose of using the 'kubectl drain' command in a Kubernetes cluster?\", \"How does 'kubectl drain' handle eviction requests that are temporarily rejected?\", \"What happens to the pods on a node when 'kubectl drain' is executed?\", \"What does it mean for a node to be marked as going out of service in Kubernetes?\", \"Is there a timeout for the 'kubectl drain' command, and what happens when it is reached?\"]",
    "49ee3087": "[\"What is the format of a URL that refers to a Kubernetes object?\", \"Can two objects of the same kind have the same name simultaneously?\", \"What happens if you delete an object with a specific name?\", \"Can you create a new object with the same name as a deleted object?\"]",
    "a900e810": "[\n    \"What is the primary purpose of EndpointSlices in Kubernetes?\",\n    \"Can EndpointSlices be manually configured even if they don't have specified selectors?\",\n    \"How do EndpointSlices relate to the IP addresses of Pods?\"\n]",
    "b3ba0fe9": "[\"What is the purpose of namespaces in a Kubernetes cluster?\", \"How does namespace-based scoping affect resource names in Kubernetes?\", \"Which types of resources does namespace-based scoping apply to in Kubernetes?\", \"Can you use namespaces to organize cluster-wide resources in Kubernetes?\", \"Why do resource names need to be unique within a namespace?\"]",
    "70b67654": "[\"What are ResourceSlices and what role do they play in dynamic resource allocation within a Kubernetes cluster?\", \"How does Kubernetes utilize ResourceSlices to allocate resources to a ResourceClaim?\", \"What happens when a is created in a Kubernetes cluster in terms of resource allocation and scheduling?\", \"Who or what is responsible for creating and managing ResourceSlices in a Kubernetes cluster?\", \"How do ResourceSlices contribute to the process of scheduling a Pod onto a node?\"]",
    "7d3f4658": "[\"What role do Helm charts play in managing Kubernetes applications?\", \"How does a single Helm chart vary in terms of deployment complexity?\", \"What are some examples of applications that can be deployed using a Helm chart?\", \"What is a practical use of charts in the Kubernetes ecosystem?\", \"How does Helm simplify the sharing of Kubernetes applications?\"]",
    "4e4fa3af": "[\"What factors determine the QoS Class assigned to a Pod in Kubernetes?\", \"At what point is the QoS Class of a Pod determined?\", \"What are the different QoS classes that Kubernetes can assign to a Pod?\", \"How does Kubernetes use QoS classes in managing Pods?\", \"What potential actions are influenced by a Pod's QoS Class in a Kubernetes cluster?\"]",
    "3f4dbf8b": "[\"What is the purpose of a PodTemplate in Kubernetes?\", \"How do workload management controllers use Pod templates?\", \"In what situation would you have multiple Pods based on the same template?\", \"Why might it be unnecessary to create a PodTemplate object directly?\"]",
    "9bbf3737": "[\"What is the primary function of controllers in Kubernetes?\", \"How do controllers in Kubernetes monitor the state of the cluster?\", \"Which components are examples of controllers that run inside the control plane in Kubernetes?\", \"What is the relationship between the desired state and the current state in the context of Kubernetes controllers?\", \"Why are control loops crucial to the operations of Kubernetes?\"]",
    "6df90e80": "[\"What fundamental hardware facilities do computers provide as resources in Kubernetes?\", \"How does Kubernetes abstract resources for allocation to workloads?\", \"What does Kubernetes utilize to manage resource consumption on nodes?\", \"What is the purpose of dynamic resource allocation in Kubernetes?\"]",
    "e1e3ce5e": "[\"What is the main purpose of the tool mentioned in the text?\", \"What can kubeadm install in a Kubernetes setup?\", \"How does the tool contribute to the security of a Kubernetes cluster?\"]",
    "82f0dea4": "[\"What role does Istio play in managing traffic and integrating microservices?\", \"How does Istio's position in the network affect application code?\", \"What does the term 'service mesh' refer to in the context of Istio?\", \"How does Istio's control plane interact with different cluster management platforms like Kubernetes?\", \"What are the primary functions Istio provides in terms of policy enforcement and telemetry data aggregation?\"]",
    "34c54dce": "[\"What operating systems can containerd run on as a daemon?\", \"What are some of the main functions of containerd?\", \"How does containerd handle container images?\"]",
    "fd0bc66f": "[\"What is the purpose of the agent that runs on each node in the Kubernetes cluster?\", \"How does the kubelet ensure that the containers described in PodSpecs remain healthy?\", \"Through what means does the kubelet receive the PodSpecs?\", \"Does the kubelet manage containers that were not initiated by Kubernetes?\", \"What is the consequence if a container was not created by Kubernetes in terms of management by the kubelet?\"]",
    "3cd533ca": "[\"What types of cluster resources does Kubernetes garbage collection clean up?\", \"How does Kubernetes handle unused containers and images during garbage collection?\", \"What happens to failed Pods under the Kubernetes garbage collection process?\", \"How does Kubernetes manage completed Jobs through garbage collection?\", \"What role does the concept of ownership play in Kubernetes garbage collection?\"]",
    "fd3f34cc": "[\n    \"What advantage does dynamic provisioning offer to cluster administrators regarding storage management?\",\n    \"How does dynamic provisioning of storage work in Kubernetes?\",\n    \"What is the role of the API object in dynamic volume provisioning?\"\n]",
    "6dd9ec20": "[\"What is the primary function of cAdvisor in Kubernetes?\", \"How does cAdvisor collect and manage data for each container?\", \"What specific types of information does cAdvisor keep track of for containers?\", \"Does cAdvisor provide data on a machine-wide level or only at the container level?\", \"What kind of historical data does cAdvisor maintain for containers?\"]",
    "49703179": "[\"What role do objects play in the Kubernetes API system?\", \"How does a Kubernetes object reflect a user's desired state for a cluster?\", \"What does Kubernetes do to maintain the state represented by an object after it's created?\", \"In what way does creating a Kubernetes object communicate with the system?\", \"Why is a Kubernetes object described as a 'record of intent'?\"]",
    "42d83b79": "[\"What is the purpose of adding an ephemeral container to a Pod?\", \"Why are ephemeral containers not suitable for running part of the main workload?\", \"What limitations do ephemeral containers have in terms of scheduling and guarantees?\", \"Under what circumstances might one use an ephemeral container in Kubernetes?\", \"Are there any Kubernetes environments where ephemeral containers are not supported?\"]",
    "5e80cac9": "[\"What is the main function of a Volume Plugin in Kubernetes?\", \"What are the two types of volume plugins mentioned in the text?\", \"How do in tree volume plugins differ from out of tree plugins in terms of development and release cycle?\"]",
    "0794e996": "[\n  \"What is the purpose of a ResourceClaimTemplate in Kubernetes?\",\n  \"How does Kubernetes use ResourceClaimTemplates in dynamic resource allocation?\",\n  \"What happens to a ResourceClaim object when the associated Pod terminates in Kubernetes?\",\n  \"How does Kubernetes ensure that each Pod accesses a separate, similar resource using ResourceClaimTemplates?\",\n  \"In what scenario does Kubernetes automatically create ResourceClaim objects based on a template?\"\n]",
    "76c3e002": "[\"What is the purpose of a manifest in Kubernetes?\", \"In what formats can a Kubernetes API object be specified?\", \"How many manifests can a single YAML file contain in Kubernetes?\"]",
    "d98b2083": "[\"What role do finalizers play in the deletion process of Kubernetes objects?\", \"How does Kubernetes indicate that an object is marked for deletion when it has finalizers?\", \"What happens to an object in Kubernetes after the finalizers' conditions are met?\", \"How can finalizers be used to manage resource deletion in Kubernetes?\", \"What status code does Kubernetes return when a delete request is accepted for an object with finalizers?\"]",
    "f853338c": "[\"What is the primary function of a cgroup in Linux?\", \"Which resources can be managed by a cgroup?\", \"How does a cgroup differ from individual process management in Linux?\"]",
    "ea355214": "[\"What does an API object do in Kubernetes with regards to managing applications?\", \"How are replicas represented and distributed in a Kubernetes cluster?\", \"What should you consider using if your application workloads require local state?\"]",
    "eb0f48a1": "[\"What is the purpose of certificates within a Kubernetes cluster?\", \"How do certificates ensure secure access to the Kubernetes API?\", \"Why is it necessary for applications inside the cluster to have validated certificates?\"]",
    "31d109d1": "[\"What is the main purpose of Kubernetes in the context of containerized applications?\", \"How does Kubernetes ensure that containerized applications are deployed and managed consistently across different environments?\", \"What role do Kubernetes objects play in the management of an application's lifecycle?\", \"How does Kubernetes handle scaling of applications to accommodate varying loads?\", \"What are some benefits of using Kubernetes for managing microservices architectures?\"]",
    "f1f911cd": "[\"What is the purpose of working groups within the Kubernetes community?\", \"How do working groups differ from long-term organizational structures in Kubernetes?\", \"Where can I find more details about the existing working groups and SIGs in Kubernetes?\"]",
    "8db7df66": "[\"What are logs used for in a Kubernetes cluster?\", \"How can logs assist in debugging within a Kubernetes environment?\", \"Why are logs important for monitoring activities in a cluster?\", \"What types of logs can be found in a Kubernetes cluster?\", \"How do logs contribute to understanding cluster events?\"]",
    "0ed59e46": "[\"What is the purpose of a Contributor License Agreement (CLA) in the context of open source projects?\", \"How do CLAs assist in addressing potential legal issues related to contributions?\", \"In what way do CLAs relate to intellectual property in open source projects?\"]",
    "b2f3b4e2": "[\"What are some components that the infrastructure layer is responsible for in Kubernetes?\", \"How does the infrastructure layer contribute to networking in a Kubernetes environment?\", \"In what way does the infrastructure layer enhance security within Kubernetes?\"]",
    "0f13555d": "[\n    \"What are the three essential properties of a core object related to scheduling in Kubernetes?\",\n    \"How do taints and tolerations function together to manage pod scheduling on nodes?\",\n    \"Why are taints applied to nodes in Kubernetes?\"\n]",
    "b083d43e": "[\"What is meant by a 'Managed Service' in the context of software offerings?\", \"Can you give some examples of Managed Services provided by third-party providers?\", \"Are Managed Services limited to certain types of software, or can they be any software offering?\"]",
    "18b35c41": "[\n    \"What is a static pod in Kubernetes and how is it managed?\",\n    \"How does the API server interact with static pods in Kubernetes?\",\n    \"What features or functionalities are not supported by static pods?\"\n]",
    "f202d113": "[\n    \"How does a StatefulSet ensure that each Pod maintains a unique identity even if rescheduled?\",\n    \"What is one advantage of using a StatefulSet when dealing with persistent storage volumes?\",\n    \"In what way does a StatefulSet differ from a Deployment in managing Pods?\",\n    \"Why might StatefulSet be a preferred choice when a sticky identity for Pods is required?\"\n]",
    "0b79951d": "[\n  \"What is the primary function of a ResourceQuota in a Kubernetes namespace?\",\n  \"How does a ResourceQuota limit the creation of resources by type within a namespace?\",\n  \"In what way can a ResourceQuota manage overall resource consumption in a namespace?\"\n]",
    "a1b02114": "[\"What are user namespaces in the context of the Linux kernel?\", \"How do user namespaces help enhance container security?\", \"What distinction is made between namespaces in Linux and Kubernetes with regards to user namespaces?\", \"Why might a user choose to use user namespaces when running containers?\", \"How do user namespaces mitigate the risks of potential container break-out attacks?\"]",
    "e02d70c6": "[\"What is the main function of an init container in a Kubernetes pod?\", \"How do init containers differ in execution order compared to regular app containers?\", \"Do init containers stay running after the Pod has started?\", \"Where can I find more detailed information about init containers in Kubernetes?\"]",
    "5c5ec427": "[\"What is the purpose of the Gateway API in Kubernetes?\", \"How does the Gateway API differ from other API kinds in Kubernetes?\", \"What features make the Gateway API protocol-aware?\", \"How does the Gateway API support the different roles?\", \"In what aspect is the Gateway API described as extensible?\"]",
    "a4ecfc70": "[\"What is the purpose of events in a Kubernetes cluster?\", \"Why should event consumers not depend on the timing or consistency of events?\", \"How does Kubernetes auditing differ from regular events?\", \"What is the recommended way to use events in Kubernetes?\", \"What is the retention policy for events in Kubernetes clusters?\"]",
    "55f6611c": "[\"What is the purpose of using key-value pairs in Kubernetes annotations?\", \"What kind of data can be included in Kubernetes annotations?\", \"Who can access the metadata stored in Kubernetes annotations?\", \"Are there any restrictions on the size or format of data in Kubernetes annotations?\", \"Can characters that are usually not permitted be included in the metadata of Kubernetes annotations?\"]",
    "602253aa": "[\"What is the role of the Eviction API in the process of API-initiated eviction?\", \"How can you request an eviction using the kube-apiserver?\", \"What are two factors that API-initiated evictions take into account when terminating a pod?\", \"How does API-initiated eviction differ from node-pressure eviction?\"]",
    "c2ba7e78": "[\"What is the purpose of a Service in a Kubernetes cluster?\", \"How does a Service determine which Pods to target?\", \"What happens to the network traffic when the set of Pods changes?\", \"What networking methods can Kubernetes Services use?\", \"How does the Service abstraction relate to mechanisms like Ingress and Gateway?\"]",
    "1ac90aa9": "[\"What is the purpose of the 'securityContext' field in Kubernetes?\", \"Can you list some specific configurations you can define in a 'securityContext'?\", \"How does the 'PodSpec.securityContext' setting affect containers within a pod?\", \"What are some examples of security policies that can be configured in a 'securityContext'?\", \"Does the 'securityContext' allow for setting the user and group for running processes?\"]",
    "ac22e8a2": "[\"What is the main purpose of eviction in Kubernetes?\", \"How many types of eviction are there in Kubernetes?\", \"What are the two kinds of eviction mentioned in the Kubernetes documentation?\"]",
    "43840b13": "[\"What is Minikube used for in the context of Kubernetes?\", \"How does Minikube run a local Kubernetes cluster on your computer?\", \"In what kind of environment can you use Minikube to try Kubernetes?\"]",
    "85a2ca75": "[\"What are the two nested object fields that govern the configuration of a Kubernetes object?\", \"When configuring the 'spec' field of a Kubernetes object, what information must be provided?\", \"How does the 'spec' field differ among various Kubernetes objects like Pods, StatefulSets, and Services?\", \"What kind of settings are included in a Kubernetes object's 'spec' field for it to reach its desired state?\", \"How does Kubernetes use the 'spec' field to maintain the state of an object?\"]",
    "09a35c88": "[\"What role does a cluster architect play in designing Kubernetes infrastructure?\", \"What best practices do cluster architects focus on concerning distributed systems?\", \"How does high availability factor into the responsibilities of a cluster architect?\", \"In what ways do cluster architects ensure security within Kubernetes clusters?\", \"Why might multiple Kubernetes clusters be deployed in a single infrastructure design?\"]",
    "9a3ee949": "[\"What is a core function of Kubernetes in relation to container management?\", \"Which container runtimes are compatible with Kubernetes?\", \"What interface standard does Kubernetes rely on for container runtime implementations?\"]",
    "b530205f": "[\"What is the difference between a Role and a ClusterRole in Kubernetes?\", \"How does a RoleBinding differ from a ClusterRoleBinding in terms of scope and permissions?\", \"What kinds of objects are used by RBAC to manage permissions in Kubernetes?\", \"Can a Role be used to define permissions that apply across an entire Kubernetes cluster?\", \"How can administrators dynamically configure access policies in Kubernetes?\"]",
    "ef5508a7": "[\"What is the purpose of affinity in Kubernetes?\", \"What are the two types of affinity mentioned in the text?\", \"How does node affinity differ from pod-to-pod affinity?\", \"What determines whether the affinity rules are required or preferred?\", \"How does the scheduler use the affinity rules to decide pod placement?\"]",
    "686b0c46": "[\"What was the role of the deprecated Kubernetes API known as PodSecurityPolicy?\", \"In which version of Kubernetes was PodSecurityPolicy removed?\", \"What can be used as alternatives to PodSecurityPolicy after its removal in Kubernetes?\", \"When was PodSecurityPolicy deprecated in Kubernetes?\", \"What is Pod Security Admission in the context of Kubernetes?\"]",
    "fad51769": "[\"What is the main purpose of setting a Pod Disruption Budget in Kubernetes?\", \"How does a Pod Disruption Budget impact voluntary pod evictions?\", \"Can Pod Disruption Budgets prevent involuntary disruptions to pods?\", \"Do involuntary pod disruptions affect the limits set by a Pod Disruption Budget?\"]",
    "3f402161": "[\n    \"What is the main purpose of a ReplicaSet in a Kubernetes cluster?\",\n    \"How do workload objects utilize ReplicaSets in a Kubernetes environment?\",\n    \"What does a ReplicaSet aim to ensure within a cluster according to its specifications?\"\n]",
    "8a0813c7": "[\"What is the primary role of a Pod in Kubernetes?\", \"How many primary containers does a Pod typically run?\", \"What additional features can sidecar containers provide in a Pod?\", \"Who usually manages Pods within a Kubernetes environment?\"]",
    "f8ef73dd": "[\"What is the purpose of having multiple replicas of a pod in a Kubernetes cluster?\", \"How does defining the number of replicas in a Deployment or ReplicaSet affect a Kubernetes cluster?\", \"What benefits do replicas provide in terms of application availability and scalability?\", \"In what ways do replicas contribute to the load balancing and update processes in Kubernetes?\", \"How does Kubernetes handle a situation where the number of running instances differs from the specified number of replicas?\"]",
    "0719b5ff": "[\"What does a resource represent in the Kubernetes type system?\", \"How is an operation on objects depicted in Kubernetes resources?\", \"What does each resource signify on the Kubernetes API server?\", \"How is the schema for objects or operations defined in the Kubernetes API server resources?\"]",
    "858ba476": "[\n  \"What activities can members participate in through GitHub teams in the Kubernetes community?\",\n  \"What happens to a member's pull requests in terms of testing procedures?\",\n  \"What is expected of a member in the Kubernetes community in terms of contribution?\"\n]",
    "4629cd57": "[\"What is the primary function of the Kubernetes cloud controller manager?\", \"How does the cloud controller manager benefit the development pace between cloud providers and the Kubernetes project?\", \"What is the role of the cloud controller manager in managing components that interact with cloud platforms versus cluster-only components?\"]",
    "c5fd214c": "[\"What technology does Docker Engine use to achieve operating-system-level virtualization?\", \"Which Linux kernel features are utilized by Docker for resource isolation?\", \"How does Docker differ from traditional virtual machines in terms of resource management and overhead?\"]",
    "68eaabb9": "[\"What is a workload in the context of Kubernetes?\", \"What are some core objects in Kubernetes related to workloads?\", \"Can you give an example of how different parts of a workload might be distributed in Kubernetes?\"]",
    "7b3b419f": "[\"What is the purpose of using CEL in Kubernetes?\", \"How can CEL expressions be utilized with dynamic admission control in Kubernetes?\", \"In what way can CEL be applied to dynamic resource allocation in Kubernetes?\"]",
    "19ee64a7": "[\n    \"What resources are essential for running containers within Kubernetes?\",\n    \"How do containers connect to a network in Kubernetes?\",\n    \"What is the role of the layer that provides CPU, memory, network, and storage capacities?\"\n]",
    "5c24ffd6": "[\"What is the role of a service account when processes inside Pods access the cluster?\", \"What happens if you do not specify a service account when creating a Pod?\", \"What service account is automatically assigned to a Pod if none is specified during its creation?\"]",
    "cf51066f": "[\"What does a Job in Kubernetes do?\", \"How does a Job ensure the specified number of Pods successfully complete?\", \"What does the Job do as Pods complete their tasks?\"]",
    "90223ebe": "[\"What are Group Version Resources (GVRs) used for in Kubernetes?\", \"How do GVRs help when APIs change?\", \"What does the term 'resource' refer to in the context of GVRs?\", \"Why might a GVR not refer to a specific namespace?\", \"How do GVRs contribute to distinguishing different Kubernetes objects?\"]",
    "f56ec2ab": "[\"What role does a proxy server play in communication between a client and a remote service in computing?\", \"How does kube-proxy function as part of a Kubernetes cluster?\", \"What are the two modes kube-proxy can operate in and how do they differ in terms of resource usage?\", \"Why might someone choose to run kube-proxy in hybrid mode if their operating system supports it?\", \"How does the communication process work between a client, proxy, and actual server?\"]",
    "81e0da1d": "[\n    \"What is the role of the control plane component in scheduling newly created pods in Kubernetes?\",\n    \"What are the factors considered when making scheduling decisions for pods in Kubernetes?\",\n    \"How do affinity and anti-affinity specifications influence the scheduling of pods?\",\n    \"In what ways does data locality impact the scheduling decisions in Kubernetes?\",\n    \"Why might deadlines be an important factor in the scheduling process for Kubernetes workloads?\"\n]",
    "7d05c708": "[\"What is the main purpose of an Ingress in Kubernetes?\", \"What functionalities can an Ingress offer in a Kubernetes cluster?\", \"Does an Ingress handle SSL termination for services in a Kubernetes cluster?\", \"Can an Ingress object provide virtual hosting features for a cluster?\", \"How does an Ingress relate to load balancing in Kubernetes?\"]",
    "8ac45c9b": "[\"What aspects do approvers consider for the holistic acceptance of a Kubernetes code contribution?\", \"How does the role of an approver differ from a code reviewer in the context of Kubernetes?\", \"What was the previous title used for someone with approver status in Kubernetes?\", \"To what extent is an approver's authority limited within the Kubernetes codebase?\"]",
    "2ed9fe33": "[\"What are Kubernetes add-ons and how do they enhance a cluster's functionality?\", \"Where can I find more information about installing add-ons in Kubernetes?\", \"What type of content would I expect to find in the Kubernetes documentation about add-ons?\"]",
    "e0ac20ad": "[\n  \"What types of devices might be attached to a Kubernetes cluster?\",\n  \"Why do attached devices usually require device drivers in Kubernetes?\",\n  \"What is an example of custom hardware that could be attached to a Kubernetes environment?\"\n]",
    "73951e7d": "[\"What are lifecycle hooks in Kubernetes and what purpose do they serve?\", \"What is the PostStart hook and when does it execute?\", \"How does the PreStop hook function and when is it triggered?\", \"Are lifecycle hooks associated with a specific part of container management?\", \"What is the main difference in the timing of execution between PostStart and PreStop hooks?\"]",
    "e67ee101": "[\"What actions does the kubelet take when it discovers a static pod in its configuration?\", \"How is a mirror pod related to the Kubernetes API server once created by the kubelet?\", \"What effect does removing a mirror pod from the API server have on the kubelet's operation?\"]",
    "45f2864b": "[\"What is the role of application containers in the context of a pod?\", \"Why might someone use an init container in a pod configuration?\", \"If a pod lacks init containers, what type of containers does it contain?\"]",
    "e02d2ae0": "[\"What does the duration format in Kubernetes represent and where is it derived from?\", \"How are Kubernetes durations expressed in the API, and what is their structure?\", \"What are the valid time units you can use when specifying a duration in Kubernetes?\", \"Can a Kubernetes duration consist of multiple time quantities, and how are these quantities interpreted?\", \"Could you give an example of how a duration might be formatted in Kubernetes?\"]",
    "2768dcc5": "[\"How can you modify the activation status of an API group in Kubernetes?\", \"What is the purpose of having API groups within the Kubernetes API?\", \"Where can you find more detailed information on API groups and versioning in Kubernetes?\"]",
    "0c3cd33e": "[\"What is the purpose of using selectors in Kubernetes?\", \"How do selectors help when querying lists of resources in Kubernetes?\", \"What role do labels play in the use of selectors for filtering resources?\"]",
    "fb34bfeb": "[\"What is the purpose of using CIDR in Kubernetes networking?\", \"How does CIDR facilitate IP address allocation in Kubernetes?\", \"Is CIDR applicable to both IPv4 and IPv6 in Kubernetes?\", \"What role does a subnet mask play in CIDR notation within Kubernetes?\"]",
    "6a621a1c": "[\n  \"What is the primary protocol used by Kubernetes for communication with the Container Runtime?\",\n  \"Which interface defines the gRPC protocol used for communication between node components and the Container Runtime in Kubernetes?\",\n  \"Where can I find more details about node components in the Kubernetes architecture?\"\n]",
    "e7862e4a": "[\"What is the purpose of the Container Storage Interface (CSI) in Kubernetes?\", \"How do custom storage plugins differ from traditional plugins in Kubernetes in terms of integration?\", \"What is a necessary step before utilizing a CSI driver from a storage provider in a Kubernetes cluster?\", \"Where can you find more detailed information on specific CSI drivers available for use with Kubernetes?\"]",
    "1ddf333c": "[\"What is the purpose of the layer mentioned in the context of Kubernetes?\", \"What types of applications operate within this layer?\", \"How are the applications described in the text prepared for operation in this layer?\"]",
    "8d89aed0": "[\"What are the main components included in a StorageClass that help manage storage types?\", \"How can users request a specific storage type in Kubernetes?\", \"What roles do 'provisioner', 'parameters', and 'reclaimPolicy' fields play in a StorageClass?\"]",
    "bf5a3ef1": "[\"What is the main purpose of a SIG in Kubernetes?\", \"How do SIGs maintain governance within their groups?\", \"Where can I find a list of current SIGs and Working Groups in Kubernetes?\", \"What interests might members of a SIG share?\", \"Can SIGs have their own methods of contribution and communication apart from the governance guidelines?\"]",
    "dc169184": "[\"What is the primary purpose of a PersistentVolume in a Kubernetes cluster?\", \"How do PersistentVolumes abstract the details of storage provision and consumption?\", \"When would you use PersistentVolumeClaims instead of directly using PersistentVolumes?\", \"What are the differences between static provisioning and dynamic provisioning in the context of Kubernetes storage?\"]",
    "03465c70": "[\n  \"What command can you use to list all images running in a Kubernetes cluster across all namespaces?\",\n  \"How can you retrieve the names and images of all pods specifically in the 'default' namespace?\",\n  \"What is the correct command to list all images in a cluster, excluding a specific image named 'registry.k8s.io/coredns:1.6.2'?\",\n  \"How would you display all metadata fields for pods in every namespace, regardless of their specific names?\"\n]",
    "cdac89d1": "[\"What is the purpose of using the '-o=jsonpath' option in 'kubectl get pods'?\", \"How would you retrieve only the name of the first pod using the jsonpath option?\", \"If you wanted to get the metadata name and status capacity of all pods, what would the jsonpath query look like?\", \"In a Windows environment, how should a JSONPath template with spaces be quoted in a 'kubectl' command?\", \"What is the difference in output when getting pod information with '-o json' compared to '-o=jsonpath'?\"]",
    "aecc7cc0": "[\"What are the main components of a Kubernetes cluster?\", \"How does Kubernetes ensure that applications are running as desired?\", \"What role do nodes play in a Kubernetes environment?\", \"Can you explain the concept of a pod in Kubernetes?\", \"How does Kubernetes handle scaling of applications?\"]",
    "0f12ee5c": "[\"What is the primary function of the kubectl command?\", \"Where can I find more detailed information about the kubectl tool?\", \"What is the basic syntax for using kubectl with flags?\"]",
    "96890108": "[\"What are the main components of a Kubernetes cluster?\", \"How does a Kubernetes Pod differ from a Node?\", \"What role does the API server play in a Kubernetes cluster?\"]",
    "8789a9d4": "[\"What is the primary purpose of Kubernetes in managing containerized applications?\", \"How does Kubernetes ensure high availability for applications?\", \"Can you explain the role of a pod within Kubernetes?\", \"What mechanisms does Kubernetes use to scale applications automatically?\", \"How does Kubernetes handle resource allocation for different applications?\"]",
    "58e490dc": "[\"What are the basic components of a Kubernetes cluster?\", \"How does Kubernetes manage containerized applications across a cluster?\", \"What role does the Kubernetes API server play in the cluster architecture?\", \"Can you explain how Kubernetes uses controllers and schedulers?\", \"What is the purpose of a pod in Kubernetes?\"]",
    "19ee0bd4": "[\"What command would you use to update the service account in a cluster role binding?\", \"How can you update a role binding to include multiple users and a group?\", \"What does the --dry-run=client option do when updating rolebinding subjects?\"]",
    "ac37f03f": "[\n  \"What happens to an existing selector on a resource when a new selector is set?\",\n  \"What are the character and length requirements for setting a selector?\",\n  \"Which resource type currently supports setting selectors with this method?\",\n  \"How does specifying the --resource-version affect the update process for selectors?\",\n  \"In the provided example, what purpose does the --dry-run=client option serve?\"\n]",
    "33c47c3e": "[\"What are the possible resources where environment variables can be managed in Kubernetes?\", \"How can you update the environment variables of a specific deployment to include a new key-value pair?\", \"What command would you use to list all environment variables for a specific deployment?\", \"How can environment variables be imported from a config map with a specified prefix using kubectl?\", \"What is the command to remove an environment variable from all deployment configurations while targeting a specific container?\"]",
    "6a49db46": "[\"What command is used to update the service account of a deployment?\", \"Which resources can have their service account updated using the given command?\", \"How can you simulate updating a deployment's service account without sending the command to the API server?\"]",
    "4ee82c41": "[\"What happens if a request is not specified for a compute resource like CPU or memory?\", \"How can you set both limits and requests for CPU and memory on a deployment's container using kubectl?\", \"What command would you use to remove resource requests for a deployment's containers?\", \"How can you update resource limits for a container in a YAML file locally without applying changes to the server?\"]",
    "3576381d": "[\"What Kubernetes command would you use to update the image of a specific container in a deployment to a new version?\", \"How can you update the image of all containers in a specific daemonset to a specified image?\", \"Which flag would allow you to update the container image from a file without connecting to the server?\", \"Can you update multiple resource types, like deployments and replication controllers, at the same time using a single command?\", \"Is it possible to specify multiple containers and their respective images in one command when updating a resource?\"]",
    "ea602a47": "[\"What is the purpose of the 'kubectl set' command in Kubernetes?\", \"How does the 'kubectl set SUBCOMMAND' syntax help in managing application resources?\", \"What type of changes can be made to application resources using 'kubectl set'?\"]",
    "647cbc0a": "[\n    \"What command would you use to start a pod with a specific name and image?\",\n    \"How can you expose a specific port on a pod using the kubectl run command?\",\n    \"What is the purpose of using the --dry-run option when running a pod?\",\n    \"How do you set multiple environment variables when starting a pod with the kubectl run command?\",\n    \"What does the --overrides option achieve when starting a pod?\"\n]",
    "b703bead": "[\"What command can be used to print all supported API resources on a Kubernetes server?\", \"How can you print the supported API resources along with additional details?\", \"Which command would you use to sort the list of supported API resources by name?\", \"How do you display only the API resources that are namespaced?\", \"How can you list API resources from a specific API group, such as 'rbac.authorization.k8s.io'?\"]",
    "3b9fa335": "[\"What are annotations in Kubernetes and how do they differ from labels?\", \"What happens if I try to add an annotation that already exists and how can it be resolved?\", \"How can you update an annotation on multiple Kubernetes resources at once?\", \"What is the purpose of the --resource-version flag in the context of modifying annotations?\", \"How do you remove an annotation from a Kubernetes resource?\"]",
    "9ce0785e": "[\n  \"What is the default output destination when running the 'kubectl cluster-info dump' command without specifying an output directory?\",\n  \"How can you include log data for pods in the cluster information dump, and where are these logs organized?\",\n  \"Which flag would you use if you want to include information from all namespaces in the cluster dump?\",\n  \"How can you specify a particular directory location to save the cluster dump files?\",\n  \"If you need to dump information from specific namespaces only, which flag allows you to do that?\"\n]",
    "7e05cfcc": "[\"What command is used to display the addresses of the control plane and services in Kubernetes?\", \"Which label is associated with the services whose addresses are displayed by the 'kubectl cluster-info' command?\", \"What command can be used to debug and diagnose cluster issues in Kubernetes?\", \"In the context of 'kubectl cluster-info', what is the purpose of using flags?\", \"What type of information does 'kubectl cluster-info' output provide?\"]",
    "25a6e17a": "[\"What is the purpose of the 'kubectl explain' command in Kubernetes?\", \"How can you retrieve information about all fields of a resource using 'kubectl explain'?\", \"What does the API version parameter do in the 'kubectl explain' command?\", \"How is information about each field retrieved and formatted from the server?\", \"What command would you use to get the explanation of a specific field within a Kubernetes resource?\"]",
    "53f41626": "[\"How can you describe resources in Kubernetes using their name prefix or label selector?\", \"What is the command to get a detailed description of all resources of a particular type using kubectl?\", \"If you wanted to describe all pods created by a specific replication controller, which command would you use?\", \"How does kubectl handle a request if there is no exact match for the TYPE and NAME_PREFIX provided?\", \"What command can you use to describe a resource using a configuration file in Kubernetes?\"]",
    "890eaa78": "[\"What is the default editor used for editing resources if the KUBE_EDITOR or EDITOR environment variables are not set?\", \"How can you specify to edit a resource in JSON format instead of the default YAML?\", \"What should you do if another editor changes a resource on the server while you are editing it?\", \"Can you edit multiple resources at once with the edit command, and how are changes applied in such cases?\", \"How can you specify to use Windows line endings when editing a resource?\"]",
    "66b92e95": "[\n    \"How can you retrieve logs from a pod that has multiple containers?\",\n    \"What option should be used to stream logs from a pod and continue logging even if errors occur?\",\n    \"How can you obtain logs from a specific pod but limit the log file size to a certain number of bytes?\",\n    \"What command would you use to get logs from all containers in pods that have a specific label?\",\n    \"How can you fetch logs from a job named 'hello'?\"\n]",
    "e4221b52": "[\n  \"What does the 'kubectl create namespace' command do in Kubernetes?\",\n  \"How can you create a namespace called 'my-namespace' using kubectl?\",\n  \"What options are available for the --dry-run flag when creating a namespace?\"\n]",
    "a0890912": "[\"How can you request a service account token for a specific namespace using kubectl?\", \"What command would you use to get a token with a custom expiration time for a service account?\", \"How can you request a token with a specific audience using the kubectl command?\", \"What is the purpose of binding a token to a Secret object, and how is it specified in the command?\", \"How do you request a token bound to a Secret object with a specific UID?\"]",
    "6ea305f1": "[\"What command would you use to create an ingress that directs all requests to '/path' to a specific service and specifies an Ingress Class?\", \"How can you create an ingress that uses TLS with a specified secret and a path type of Prefix?\", \"What is the command to create an ingress with multiple paths for the same host 'foo.com'?\", \"How do you create an ingress with two specific annotations and a default Ingress Class?\", \"In what way can you create a default backend for an ingress using the specified command syntax?\"]",
    "dd580d9f": "[\"What command would you use to create a deployment named 'my-dep' that uses the busybox image and specifies a command to run?\", \"How can you create a deployment with a specific number of replicas using the nginx image?\", \"What is the command for creating a deployment that uses multiple container images?\", \"Is it possible to specify a port to be exposed when creating a deployment, and if so, how?\", \"What are the basic requirements when using 'kubectl create deployment' to set up a deployment?\"]",
    "7646bf18": "[\"What is the purpose of using the command 'kubectl create service loadbalancer NAME' in Kubernetes?\", \"How do you specify the ports when creating a LoadBalancer service using kubectl?\", \"What is the effect of using the '--dry-run' flag when creating a LoadBalancer service?\", \"Can you provide an example of creating a LoadBalancer service with a specific name and port forwarding?\", \"What does the parameter '--tcp=port:targetPort' represent in the command to create a LoadBalancer service?\"]",
    "950f6633": "[\"What is the purpose of creating an ExternalName service in Kubernetes?\", \"How does an ExternalName service differ from a regular service in Kubernetes?\", \"What command would you use to create an ExternalName service named 'my-ns' that points to 'bar.com'?\", \"What do the options --dry-run=server|client|none specify when creating an ExternalName service?\", \"What is an example of when you might use an ExternalName service in Kubernetes?\"]",
    "d71a7259": "[\"What is the purpose of a docker-registry type secret in Kubernetes?\", \"How is a generic type secret referred to in Kubernetes terminology?\", \"What does a tls type secret contain in Kubernetes?\"]",
    "7b55dce5": "[\"What is the purpose of the '--value' option when creating a priority class?\", \"How would you set a priority class as the global default priority?\", \"What does the '--preemption-policy' option do when creating a priority class?\", \"How can you specify a dry run when creating a priority class?\", \"Can two priority classes have the same value, and what happens if they do?\"]",
    "29a13236": "[\"What is the purpose of a pod disruption budget in Kubernetes?\", \"How do you specify which pods a disruption budget applies to?\", \"What does the '--min-available' option define when creating a pod disruption budget?\", \"What would happen if the specified number or percentage of available pods is not met according to the pod disruption budget?\", \"How can you create a pod disruption budget for an app with a specific label?\"]",
    "a7ff9e0c": "[\"What is the default behavior for the key and value when creating a config map from a file?\", \"How does Kubernetes handle directory entries that are not regular files when creating a config map from a directory?\", \"Can you specify custom keys instead of using the file basenames when creating a config map from files?\", \"How can you create a config map using literal key-value pairs?\", \"What command can you use to create a config map from environment variable files?\"]",
    "8ef67423": "[\"What is the general command syntax for creating a service in Kubernetes using the specified subcommand?\", \"How can you ensure the output of a service creation is in JSON format?\", \"What is the role of flags when using the kubectl create service command?\"]",
    "42a027ab": "[\n  \"What is the purpose of the 'kubectl create clusterrolebinding' command in Kubernetes?\",\n  \"How can a user create a cluster role binding for multiple users and a group using the cluster-admin role?\",\n  \"What does the '--dry-run' option do in the 'kubectl create clusterrolebinding' command?\"\n]",
    "e6e242de": "[\"What is the default behavior for naming the key when creating a secret from a file?\", \"How does Kubernetes handle directory entries that are not regular files when creating a secret from a directory?\", \"Can you specify custom keys when creating a secret from files, and if so, how?\", \"What is the purpose of the '--dry-run' option in the 'kubectl create secret' command?\", \"How can you create a Kubernetes secret using a combination of files and literal values?\"]",
    "f1163f14": "[\"What command would you use to set hard limits on resources like CPU and memory for a new quota named 'my-quota'?\", \"How can you specify scopes when creating a resource quota in Kubernetes?\", \"What is the purpose of the '--dry-run' option in the 'kubectl create quota' command?\", \"How would you create a resource quota with a specific scope of 'BestEffort' for a  'best-effort' quota?\", \"What are some of the resources you can set limits on when creating a resource quota in Kubernetes?\"]",
    "cc3bf0be": "[\"What prerequisites are needed before creating a TLS secret using a public/private key pair?\", \"What file format should the public key certificate be encoded in when creating a TLS secret?\", \"How do you create a TLS secret named 'tls-secret' using kubectl?\", \"What is the purpose of the '--dry-run' option in the 'kubectl create secret' command?\", \"What paths should be specified in the kubectl command to create a TLS secret?\"]",
    "9a989473": "[\"What is the purpose of specifying a schedule in the cron job command?\", \"How can you create a cron job with a specific command to execute?\", \"What is the function of the image parameter when creating a cron job?\", \"How often will a cron job scheduled with '*/1 * * * *' execute?\", \"What does the '--' signify in the cron job creation command?\"]",
    "15a5b01e": "[\"What is the basic command structure to create a job in Kubernetes?\", \"How can you specify an image for the job you are creating?\", \"What command would you use if you want to create a job based on an existing cron job?\", \"Can you specify a particular command for the job to execute and if so, how?\", \"What does the `--from` flag do when creating a job?\"]",
    "d40cfb15": "[\"What is the purpose of the '--tcp' flag when creating a ClusterIP service?\", \"How can you specify a ClusterIP service to run in headless mode?\", \"What does the '--dry-run' option do when creating a service clusterip?\"]",
    "2ce03fe9": "[\n  \"What command would you use to create a role that allows getting, watching, and listing pods in Kubernetes?\",\n  \"How can you specify multiple resource names for a role in Kubernetes?\",\n  \"How do you create a role in Kubernetes with actions specified for a subresource?\"\n]",
    "b2569f93": "[\"What is the primary purpose of using a role binding in Kubernetes?\", \"How can you specify multiple users and groups when creating a role binding?\", \"What is the difference between using --role=NAME and --clusterrole=NAME when creating a role binding?\", \"How can you create a role binding specifically for a service account in Kubernetes?\", \"What is the function of the --dry-run option in the role binding command?\"]",
    "64214de0": "[\"What is the purpose of creating a Dockercfg secret in Kubernetes?\", \"How can you authenticate to a Docker registry using the Docker command line?\", \"What information is necessary to create a docker-registry secret using kubectl?\", \"Is the email address mandatory when authenticating to a Docker registry or creating a Docker secret?\", \"How can you create a Kubernetes secret from an existing .docker/config.json file?\"]",
    "9f6949e2": "[\"What does the command 'kubectl create service nodeport NAME' do in a Kubernetes context?\", \"In the given example command, what is the significance of '--tcp=5678:8080'?\", \"What is the purpose of using the '--dry-run' option when creating a NodePort service?\", \"What name is given to the new NodePort service in the example provided?\", \"How can you specify a target port when creating a NodePort service using kubectl?\"]",
    "8b2d0bc3": "[\"What is the purpose of using 'kubectl create serviceaccount' command in Kubernetes?\", \"How can you create a service account with a specific name in Kubernetes?\", \"What does the '--dry-run' option do when creating a service account in Kubernetes?\", \"Provide an example command to create a service account named 'my-service-account'.\", \"What are the possible values for the '--dry-run' option when creating a service account?\"]",
    "809b0671": "[\"What is the purpose of specifying multiple verbs in the cluster role creation command?\", \"How can you create a cluster role that allows accessing specific pod resources by name?\", \"What does specifying a NonResourceURL in the cluster role entail?\", \"How does specifying an AggregationRule when creating a cluster role affect its functionality?\", \"What is the significance of specifying an API Group when creating a cluster role?\"]",
    "d4d4ea5a": "[\"What file formats are accepted for creating a resource with kubectl?\", \"How can you create a pod using information from a file?\", \"What command allows you to create a pod using data passed through stdin?\", \"How can you edit a YAML file in JSON format before creating a resource?\"]",
    "96acd4b2": "[\"What command should I use to display the supported API versions in Kubernetes?\", \"In what format are the supported API versions displayed when using the appropriate command?\", \"Is there a JSON output format available for listing supported API versions, and if so, what is it?\"]",
    "f8788db9": "[\"How can you execute a command in a specific container within a pod?\", \"What is the purpose of using the '-c' option with 'kubectl exec'?\", \"How do you use 'kubectl exec' to open an interactive shell in a container?\", \"What should you be careful about when running a command with flags using 'kubectl exec'?\", \"How do you execute a command in a pod from a deployment or service using 'kubectl exec'?\"]",
    "53dea42b": "[\"What is the format required for a label key and value when updating a resource in Kubernetes?\", \"How does the --overwrite flag affect the behavior when updating labels on a resource?\", \"What happens if you use the --resource-version flag while updating labels on a resource?\", \"Can you update all pods in a namespace with a specific label in one command? How?\", \"How can you remove a specific label from a pod without using the --overwrite flag?\"]",
    "97e3c70d": "[\"What command would you use to list all pods with detailed information, such as the node name, in Kubernetes?\", \"How can you specify which attributes of a fetched resource should be displayed using a template?\", \"Which command is used to list all deployments in the 'v1' version of the 'apps' API group in JSON format?\", \"If you want to list resources in a specific namespace, how would you include the namespace in the command?\", \"How can you display the phase value of a specific pod using the kubectl get command?\"]",
    "3eb43484": "[\"What are the different arguments you can specify when deleting resources in Kubernetes?\", \"What does the --grace-period flag do when deleting resources, and when might it be ignored?\", \"What is the risk of force deleting a pod, especially in relation to shared storage or remote APIs?\", \"How can you delete resources from a directory containing a kustomization.yaml file?\", \"What is a potential consequence of deleting a resource if someone else submits an update at the same time?\"]",
    "24d99e73": "[\"What command can you use to view the resource usage of pods in Kubernetes?\", \"If you want to view the resource consumption of a specific pod by its name, what syntax would you use?\", \"How can you display metrics for pods that are selected using a specific label?\", \"What might cause a delay in the availability of resource usage metrics for newly created pods?\", \"How do you view the resource usage metrics for all pods within a specific namespace in Kubernetes?\"]",
    "a2652109": "[\"What is the purpose of the 'kubectl top node' command?\", \"How can you display the resource usage for all nodes using kubectl?\", \"What specific information can you view by using 'kubectl top node NODE_NAME'?\"]",
    "47158b98": "[\n  \"What is the primary function of the 'kubectl top' command in Kubernetes?\",\n  \"Why might the resource metrics provided by Kubernetes differ from those offered by OS tools like 'top'?\",\n  \"What prerequisites must be met for the 'kubectl top' command to operate correctly?\",\n  \"In what situations would a Kubernetes user choose to use the 'kubectl top' command?\",\n  \"Why is the 'kubectl top' command not suitable for high-accuracy reporting or alerting in Kubernetes environments?\"\n]",
    "711c3179": "[\"What is the purpose of specifying preconditions with the scale command in Kubernetes?\", \"How can you scale a replica set named 'foo' to 3 replicas using kubectl?\", \"What command would you use to scale a Kubernetes resource specified in a file named 'foo.yaml'?\", \"How can you ensure that a deployment is only scaled if its current replica count is a specific number?\", \"Can you scale multiple replication controllers at once and, if so, how?\"]",
    "03f1623c": "[\"What are the components of a taint in Kubernetes and how are they expressed?\", \"What are the rules for formatting the key and value of a taint?\", \"What taint effects are allowed in Kubernetes and what do they signify?\", \"How can a taint be removed from a node if it matches a specific key and effect?\", \"Can taints be applied to resources other than nodes in Kubernetes?\"]",
    "f5e66daa": "[\"How do you perform a rollback to the previous deployment in Kubernetes?\", \"What is the command to roll back a daemonset to a specific revision, such as revision 3?\", \"What does the --dry-run=server flag do when performing a rollback on a deployment?\"]",
    "78659d0e": "[\n    \"What is the effect of resuming a paused resource in Kubernetes?\",\n    \"Which type of Kubernetes resource supports being resumed after being paused?\",\n    \"What is the specific kubectl command to resume a paused deployment named 'nginx'?\"\n]",
    "28644f68": "[\"What is the purpose of the 'kubectl rollout restart RESOURCE' command?\", \"How can you restart all deployments within a specific namespace using kubectl?\", \"What command would you use to restart a specific deployment named 'nginx'?\", \"How do you restart a daemon set using kubectl?\", \"How can you restart deployments that have a specific label, such as 'app=nginx'?\"]",
    "84913dcf": "[\"What is the purpose of the 'rollout status' command in Kubernetes?\", \"How can you avoid waiting for the rollout to complete using the 'rollout status' command?\", \"What does 'rollout status' do if a new rollout occurs while it's still monitoring the previous one?\", \"How can you watch a specific revision of a rollout and terminate if it gets replaced by another?\", \"What command would you use to check the rollout status of a deployment named 'nginx'?\"]",
    "a197ed1e": "[\"What does it mean for a Kubernetes resource to be paused?\", \"Which resources support the pause functionality in Kubernetes?\", \"How can a paused resource be resumed in Kubernetes?\", \"Will a paused deployment continue its current operations?\", \"What is the effect of updating a paused deployment?\"]",
    "e7d7c16b": "[\"What are the valid resource types that can be managed using the rollout command in Kubernetes?\", \"How can you roll back to a previous deployment using the rollout command?\", \"What is the kubectl command to check the rollout status of a daemonset called 'foo'?\", \"How would you restart a specific deployment called 'abc' using the rollout command?\", \"If you have multiple deployments labeled 'app=nginx', what is the command to restart all of them using kubectl?\"]",
    "cc9da943": "[\n  \"What command will display the rollout history of a specific deployment in Kubernetes?\",\n  \"How can you view the details for a specific revision of a daemonset?\",\n  \"Which command is used to check the rollout history of Kubernetes resources?\"\n]",
    "850acdc7": "[\"What does the 'kubectl apply set-last-applied -f FILENAME' command do?\", \"How can you update the last-applied-configuration for multiple files within a directory?\", \"What happens if the last-applied-configuration annotation does not exist when using 'kubectl apply set-last-applied'?\"]",
    "f8072f1c": "[\"What happens if an error occurs while trying to update a resource using the edit-last-applied command?\", \"How can a user specify that the edits should be made in JSON format rather than the default YAML?\", \"What are the steps to take if another editor changes a resource on the server while you are editing it?\", \"What does the --windows-line-endings flag do when using the edit-last-applied command?\", \"How can a user choose which editor to use when running the edit-last-applied command in Kubernetes?\"]",
    "0ed2d5e8": "[\"What is the default output format for viewing last-applied-configuration annotations?\", \"How can you change the output format when viewing last-applied-configuration annotations?\", \"What command would you use to view the last-applied-configuration annotations for a specific deployment by name?\", \"How do you view the last-applied-configuration annotations from a file in JSON format?\", \"What options are available for specifying which annotations to view when using the kubectl apply view-last-applied command?\"]",
    "8666ad26": "[\"What are the file formats accepted for applying configurations to a Kubernetes resource?\", \"What should you do before using the 'apply' command to ensure the resource is properly configured?\", \"How can you apply a configuration stored in a specific directory that includes kustomization.yaml?\", \"What is the purpose of the --prune flag when applying configurations, and what caution is advised?\", \"How can you apply a configuration that matches specific labels and delete others that do not match?\"]"
}